YCSB-outputs/citus-exec-14-1000000-d-14-rf_1-bs_7000-fs_3000.txt
/usr/local/openjdk-11/bin/java -cp /opt/ycsb/slf4j-api-1.7.30.jar:/opt/ycsb/slf4j-simple-1.7.30.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.14.jar:/opt/ycsb/jdbc-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/opt/ycsb/jdbc-binding/lib/jdbc-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/opt/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.2.23.jar:/opt/ycsb/jdbc-binding/lib/commons-lang-2.4.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadd -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.JdbcDBClient -s -P /opt/ycsb/workloads/workloadd -P /opt/ycsb/jdbc-binding/conf/db.properties -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://10.0.2.5:5432/ycsb
2021-09-16 01:27:50:259 0 sec: 0 operations; est completion in 0 second 
Using shards: 1, batchSize:7000, fetchSize: 3000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-16 01:28:00:198 10 sec: 101 operations; 10.1 current ops/sec; est completion in 16 minutes [READ: Count=93, Max=289279, Min=50912, Avg=100095.31, 90=205311, 99=279551, 99.9=289279, 99.99=289279] [INSERT: Count=8, Max=7351, Min=966, Avg=2011, 90=2027, 99=7351, 99.9=7351, 99.99=7351] 
2021-09-16 01:28:10:197 20 sec: 244 operations; 14.3 current ops/sec; est completion in 13 minutes [READ: Count=134, Max=103999, Min=48192, Avg=74554.75, 90=93119, 99=103103, 99.9=103999, 99.99=103999] [INSERT: Count=9, Max=1062, Min=523, Avg=763.56, 90=958, 99=1062, 99.9=1062, 99.99=1062] 
2021-09-16 01:28:20:197 30 sec: 383 operations; 13.9 current ops/sec; est completion in 12 minutes [READ: Count=126, Max=118719, Min=48160, Avg=79136.13, 90=98239, 99=107647, 99.9=118719, 99.99=118719] [INSERT: Count=13, Max=711, Min=441, Avg=576.31, 90=637, 99=711, 99.9=711, 99.99=711] 
2021-09-16 01:28:30:197 40 sec: 516 operations; 13.3 current ops/sec; est completion in 12 minutes [READ: Count=127, Max=98815, Min=48736, Avg=78480, 90=94847, 99=98815, 99.9=98815, 99.99=98815] [INSERT: Count=6, Max=662, Min=527, Avg=603.5, 90=614, 99=662, 99.9=662, 99.99=662] 
2021-09-16 01:28:40:197 50 sec: 655 operations; 13.9 current ops/sec; est completion in 11 minutes [READ: Count=132, Max=103103, Min=49568, Avg=75760.24, 90=95935, 99=99391, 99.9=103103, 99.99=103103] [INSERT: Count=7, Max=609, Min=382, Avg=495.43, 90=549, 99=609, 99.9=609, 99.99=609] 
2021-09-16 01:28:50:197 60 sec: 788 operations; 13.3 current ops/sec; est completion in 11 minutes [READ: Count=128, Max=98495, Min=48800, Avg=78340.5, 90=92351, 99=97727, 99.9=98495, 99.99=98495] [INSERT: Count=5, Max=596, Min=448, Avg=491.6, 90=596, 99=596, 99.9=596, 99.99=596] 
2021-09-16 01:29:00:197 70 sec: 929 operations; 14.1 current ops/sec; est completion in 11 minutes [READ: Count=131, Max=104063, Min=48224, Avg=75899.73, 90=96511, 99=102399, 99.9=104063, 99.99=104063] [INSERT: Count=10, Max=974, Min=283, Avg=474.7, 90=671, 99=974, 99.9=974, 99.99=974] 
2021-09-16 01:29:10:197 80 sec: 1068 operations; 13.9 current ops/sec; est completion in 11 minutes [READ: Count=132, Max=104063, Min=47648, Avg=75941.45, 90=95231, 99=98047, 99.9=104063, 99.99=104063] [INSERT: Count=7, Max=570, Min=130, Avg=353.14, 90=438, 99=570, 99.9=570, 99.99=570] 
2021-09-16 01:29:20:197 90 sec: 1204 operations; 13.6 current ops/sec; est completion in 10 minutes [READ: Count=132, Max=102207, Min=48864, Avg=75592.85, 90=95039, 99=101119, 99.9=102207, 99.99=102207] [INSERT: Count=4, Max=327, Min=208, Avg=255, 90=327, 99=327, 99.9=327, 99.99=327] 
2021-09-16 01:29:30:197 100 sec: 1337 operations; 13.3 current ops/sec; est completion in 10 minutes [READ: Count=129, Max=101439, Min=48096, Avg=77279.26, 90=95807, 99=100159, 99.9=101439, 99.99=101439] [INSERT: Count=4, Max=210, Min=152, Avg=193.5, 90=210, 99=210, 99.9=210, 99.99=210] 
2021-09-16 01:29:40:197 110 sec: 1474 operations; 13.7 current ops/sec; est completion in 10 minutes [READ: Count=128, Max=111359, Min=49216, Avg=78060.88, 90=94527, 99=99775, 99.9=111359, 99.99=111359] [INSERT: Count=9, Max=226, Min=175, Avg=204.22, 90=211, 99=226, 99.9=226, 99.99=226] 
2021-09-16 01:29:50:197 120 sec: 1610 operations; 13.6 current ops/sec; est completion in 10 minutes [READ: Count=128, Max=100479, Min=49696, Avg=78065.5, 90=95807, 99=98623, 99.9=100479, 99.99=100479] [INSERT: Count=8, Max=246, Min=201, Avg=212.88, 90=220, 99=246, 99.9=246, 99.99=246] 
2021-09-16 01:30:00:197 130 sec: 1749 operations; 13.9 current ops/sec; est completion in 10 minutes [READ: Count=129, Max=111679, Min=48832, Avg=77353.05, 90=93759, 99=98367, 99.9=111679, 99.99=111679] [INSERT: Count=10, Max=277, Min=55, Avg=185.8, 90=212, 99=277, 99.9=277, 99.99=277] 
2021-09-16 01:30:10:197 140 sec: 1879 operations; 13 current ops/sec; est completion in 10 minutes [READ: Count=127, Max=102143, Min=48032, Avg=78621.1, 90=97791, 99=100991, 99.9=102143, 99.99=102143] [INSERT: Count=3, Max=287, Min=209, Avg=252.33, 90=287, 99=287, 99.9=287, 99.99=287] 
2021-09-16 01:30:20:197 150 sec: 2019 operations; 14 current ops/sec; est completion in 9 minutes [READ: Count=131, Max=101311, Min=48096, Avg=76126.66, 90=96703, 99=100607, 99.9=101311, 99.99=101311] [INSERT: Count=9, Max=678, Min=199, Avg=271.33, 90=287, 99=678, 99.9=678, 99.99=678] 
2021-09-16 01:30:30:197 160 sec: 2157 operations; 13.8 current ops/sec; est completion in 9 minutes [READ: Count=136, Max=98815, Min=48064, Avg=73980.47, 90=91519, 99=98431, 99.9=98815, 99.99=98815] [INSERT: Count=2, Max=249, Min=249, Avg=249, 90=249, 99=249, 99.9=249, 99.99=249] 
2021-09-16 01:30:40:197 170 sec: 2299 operations; 14.2 current ops/sec; est completion in 9 minutes [READ: Count=126, Max=103359, Min=48704, Avg=78784.63, 90=96063, 99=102975, 99.9=103359, 99.99=103359] [INSERT: Count=16, Max=337, Min=125, Avg=197.19, 90=261, 99=337, 99.9=337, 99.99=337] 
2021-09-16 01:30:50:197 180 sec: 2434 operations; 13.5 current ops/sec; est completion in 9 minutes [READ: Count=126, Max=105343, Min=48928, Avg=79398.73, 90=96127, 99=104447, 99.9=105343, 99.99=105343] [INSERT: Count=9, Max=218, Min=172, Avg=192.44, 90=210, 99=218, 99.9=218, 99.99=218] 
2021-09-16 01:31:00:197 190 sec: 2572 operations; 13.8 current ops/sec; est completion in 9 minutes [READ: Count=130, Max=101759, Min=48128, Avg=77115.45, 90=96831, 99=98111, 99.9=101759, 99.99=101759] [INSERT: Count=8, Max=266, Min=79, Avg=151.88, 90=194, 99=266, 99.9=266, 99.99=266] 
2021-09-16 01:31:10:197 200 sec: 2704 operations; 13.2 current ops/sec; est completion in 9 minutes [READ: Count=129, Max=104639, Min=48448, Avg=77444.71, 90=96895, 99=101375, 99.9=104639, 99.99=104639] [INSERT: Count=3, Max=209, Min=198, Avg=201.67, 90=209, 99=209, 99.9=209, 99.99=209] 
2021-09-16 01:31:20:197 210 sec: 2835 operations; 13.1 current ops/sec; est completion in 8 minutes [READ: Count=126, Max=102527, Min=48128, Avg=79380.32, 90=96511, 99=98047, 99.9=102527, 99.99=102527] [INSERT: Count=5, Max=253, Min=94, Avg=174.2, 90=253, 99=253, 99.9=253, 99.99=253] 
2021-09-16 01:31:30:197 220 sec: 2963 operations; 12.8 current ops/sec; est completion in 8 minutes [READ: Count=126, Max=113151, Min=49216, Avg=79024.13, 90=97215, 99=102911, 99.9=113151, 99.99=113151] [INSERT: Count=2, Max=199, Min=195, Avg=197, 90=199, 99=199, 99.9=199, 99.99=199] 
2021-09-16 01:31:40:197 230 sec: 3094 operations; 13.1 current ops/sec; est completion in 8 minutes [READ: Count=129, Max=110719, Min=47616, Avg=77666.98, 90=96511, 99=103039, 99.9=110719, 99.99=110719] [INSERT: Count=2, Max=198, Min=196, Avg=197, 90=198, 99=198, 99.9=198, 99.99=198] 
2021-09-16 01:31:50:197 240 sec: 3222 operations; 12.8 current ops/sec; est completion in 8 minutes [READ: Count=124, Max=102015, Min=47680, Avg=80142.58, 90=97023, 99=100351, 99.9=102015, 99.99=102015] [INSERT: Count=4, Max=197, Min=187, Avg=193.5, 90=197, 99=197, 99.9=197, 99.99=197] 
2021-09-16 01:32:00:197 250 sec: 3354 operations; 13.2 current ops/sec; est completion in 8 minutes [READ: Count=125, Max=100031, Min=48416, Avg=80058.5, 90=96959, 99=99455, 99.9=100031, 99.99=100031] [INSERT: Count=7, Max=255, Min=167, Avg=199.43, 90=200, 99=255, 99.9=255, 99.99=255] 
2021-09-16 01:32:10:197 260 sec: 3492 operations; 13.8 current ops/sec; est completion in 8 minutes [READ: Count=132, Max=99327, Min=48544, Avg=75914.55, 90=96127, 99=98943, 99.9=99327, 99.99=99327] [INSERT: Count=6, Max=197, Min=184, Avg=193.17, 90=197, 99=197, 99.9=197, 99.99=197] 
2021-09-16 01:32:20:197 270 sec: 3630 operations; 13.8 current ops/sec; est completion in 7 minutes [READ: Count=128, Max=99199, Min=48448, Avg=78325.38, 90=94783, 99=98623, 99.9=99199, 99.99=99199] [INSERT: Count=10, Max=272, Min=164, Avg=203.8, 90=248, 99=272, 99.9=272, 99.99=272] 
2021-09-16 01:32:30:197 280 sec: 3764 operations; 13.4 current ops/sec; est completion in 7 minutes [READ: Count=128, Max=106431, Min=49376, Avg=78055.25, 90=97087, 99=102015, 99.9=106431, 99.99=106431] [INSERT: Count=6, Max=211, Min=165, Avg=189.17, 90=191, 99=211, 99.9=211, 99.99=211] 
2021-09-16 01:32:40:198 290 sec: 3893 operations; 12.9 current ops/sec; est completion in 7 minutes [READ: Count=121, Max=118271, Min=48800, Avg=82127.07, 90=97279, 99=107519, 99.9=118271, 99.99=118271] [INSERT: Count=8, Max=194, Min=155, Avg=178.75, 90=192, 99=194, 99.9=194, 99.99=194] 
2021-09-16 01:32:50:197 300 sec: 4032 operations; 13.9 current ops/sec; est completion in 7 minutes [READ: Count=132, Max=101631, Min=48608, Avg=75518.55, 90=96703, 99=100287, 99.9=101631, 99.99=101631] [INSERT: Count=7, Max=410, Min=182, Avg=222.14, 90=201, 99=410, 99.9=410, 99.99=410] 
2021-09-16 01:33:00:197 310 sec: 4170 operations; 13.8 current ops/sec; est completion in 7 minutes [READ: Count=132, Max=98943, Min=47648, Avg=75623.03, 90=95871, 99=98303, 99.9=98943, 99.99=98943] [INSERT: Count=6, Max=185, Min=97, Avg=149.67, 90=184, 99=185, 99.9=185, 99.99=185] 
2021-09-16 01:33:10:197 320 sec: 4304 operations; 13.4 current ops/sec; est completion in 7 minutes [READ: Count=132, Max=99455, Min=47552, Avg=76085.58, 90=96127, 99=99135, 99.9=99455, 99.99=99455] [INSERT: Count=2, Max=194, Min=180, Avg=187, 90=194, 99=194, 99.9=194, 99.99=194] 
2021-09-16 01:33:20:197 330 sec: 4441 operations; 13.7 current ops/sec; est completion in 6 minutes [READ: Count=130, Max=98303, Min=48032, Avg=77141.91, 90=96831, 99=98175, 99.9=98303, 99.99=98303] [INSERT: Count=7, Max=186, Min=157, Avg=180, 90=185, 99=186, 99.9=186, 99.99=186] 
2021-09-16 01:33:30:197 340 sec: 4577 operations; 13.6 current ops/sec; est completion in 6 minutes [READ: Count=128, Max=101695, Min=48160, Avg=77942, 90=95871, 99=99263, 99.9=101695, 99.99=101695] [INSERT: Count=8, Max=200, Min=91, Avg=167.88, 90=199, 99=200, 99.9=200, 99.99=200] 
2021-09-16 01:33:40:197 350 sec: 4717 operations; 14 current ops/sec; est completion in 6 minutes [READ: Count=133, Max=100159, Min=48352, Avg=74837.65, 90=94783, 99=97919, 99.9=100159, 99.99=100159] [INSERT: Count=7, Max=186, Min=83, Avg=154.71, 90=184, 99=186, 99.9=186, 99.99=186] 
2021-09-16 01:33:50:197 360 sec: 4855 operations; 13.8 current ops/sec; est completion in 6 minutes [READ: Count=129, Max=99711, Min=48096, Avg=77340.53, 90=96063, 99=98111, 99.9=99711, 99.99=99711] [INSERT: Count=9, Max=185, Min=149, Avg=172, 90=185, 99=185, 99.9=185, 99.99=185] 
2021-09-16 01:34:00:197 370 sec: 4993 operations; 13.8 current ops/sec; est completion in 6 minutes [READ: Count=134, Max=101759, Min=47264, Avg=75064.96, 90=96511, 99=98303, 99.9=101759, 99.99=101759] [INSERT: Count=4, Max=184, Min=156, Avg=176, 90=184, 99=184, 99.9=184, 99.99=184] 
2021-09-16 01:34:10:197 380 sec: 5129 operations; 13.6 current ops/sec; est completion in 6 minutes [READ: Count=127, Max=103359, Min=48256, Avg=78072.82, 90=96639, 99=100991, 99.9=103359, 99.99=103359] [INSERT: Count=9, Max=251, Min=107, Avg=168.56, 90=195, 99=251, 99.9=251, 99.99=251] 
2021-09-16 01:34:20:197 390 sec: 5268 operations; 13.9 current ops/sec; est completion in 5 minutes [READ: Count=129, Max=101695, Min=48000, Avg=78064.5, 90=96703, 99=99903, 99.9=101695, 99.99=101695] [INSERT: Count=10, Max=171, Min=144, Avg=162.3, 90=169, 99=171, 99.9=171, 99.99=171] 
2021-09-16 01:34:30:197 400 sec: 5403 operations; 13.5 current ops/sec; est completion in 5 minutes [READ: Count=130, Max=104447, Min=47424, Avg=76500.06, 90=96191, 99=104127, 99.9=104447, 99.99=104447] [INSERT: Count=5, Max=169, Min=161, Avg=165.8, 90=169, 99=169, 99.9=169, 99.99=169] 
2021-09-16 01:34:40:197 410 sec: 5532 operations; 12.9 current ops/sec; est completion in 5 minutes [READ: Count=126, Max=101055, Min=48512, Avg=79215.11, 90=97023, 99=100671, 99.9=101055, 99.99=101055] [INSERT: Count=3, Max=171, Min=167, Avg=169, 90=171, 99=171, 99.9=171, 99.99=171] 
2021-09-16 01:34:50:197 420 sec: 5662 operations; 13 current ops/sec; est completion in 5 minutes [READ: Count=127, Max=101247, Min=47488, Avg=78758.17, 90=97087, 99=100543, 99.9=101247, 99.99=101247] [INSERT: Count=3, Max=180, Min=107, Avg=153.33, 90=180, 99=180, 99.9=180, 99.99=180] 
2021-09-16 01:35:00:197 430 sec: 5787 operations; 12.5 current ops/sec; est completion in 5 minutes [READ: Count=122, Max=117759, Min=47328, Avg=82131.41, 90=97151, 99=102207, 99.9=117759, 99.99=117759] [INSERT: Count=3, Max=245, Min=175, Avg=200, 90=245, 99=245, 99.9=245, 99.99=245] 
2021-09-16 01:35:10:197 440 sec: 5925 operations; 13.8 current ops/sec; est completion in 5 minutes [READ: Count=131, Max=101439, Min=49408, Avg=76455.82, 90=96383, 99=101247, 99.9=101439, 99.99=101439] [INSERT: Count=7, Max=177, Min=105, Avg=158.14, 90=176, 99=177, 99.9=177, 99.99=177] 
2021-09-16 01:35:20:197 450 sec: 6063 operations; 13.8 current ops/sec; est completion in 4 minutes [READ: Count=130, Max=102591, Min=49440, Avg=76645.66, 90=96319, 99=100031, 99.9=102591, 99.99=102591] [INSERT: Count=8, Max=213, Min=92, Avg=167.12, 90=190, 99=213, 99.9=213, 99.99=213] 
2021-09-16 01:35:30:197 460 sec: 6199 operations; 13.6 current ops/sec; est completion in 4 minutes [READ: Count=128, Max=100479, Min=48000, Avg=78274, 90=96703, 99=99583, 99.9=100479, 99.99=100479] [INSERT: Count=8, Max=175, Min=104, Avg=157.5, 90=174, 99=175, 99.9=175, 99.99=175] 
2021-09-16 01:35:40:197 470 sec: 6330 operations; 13.1 current ops/sec; est completion in 4 minutes [READ: Count=124, Max=102783, Min=48384, Avg=80572, 90=97535, 99=100415, 99.9=102783, 99.99=102783] [INSERT: Count=7, Max=487, Min=142, Avg=231, 90=293, 99=487, 99.9=487, 99.99=487] 
2021-09-16 01:35:50:197 480 sec: 6461 operations; 13.1 current ops/sec; est completion in 4 minutes [READ: Count=124, Max=119295, Min=48128, Avg=80183.61, 90=97791, 99=105727, 99.9=119295, 99.99=119295] [INSERT: Count=7, Max=143, Min=137, Avg=140.43, 90=142, 99=143, 99.9=143, 99.99=143] 
2021-09-16 01:36:00:197 490 sec: 6590 operations; 12.9 current ops/sec; est completion in 4 minutes [READ: Count=126, Max=100415, Min=49088, Avg=79330.54, 90=96383, 99=99327, 99.9=100415, 99.99=100415] [INSERT: Count=3, Max=173, Min=142, Avg=152.33, 90=173, 99=173, 99.9=173, 99.99=173] 
2021-09-16 01:36:10:197 500 sec: 6724 operations; 13.4 current ops/sec; est completion in 4 minutes [READ: Count=125, Max=103999, Min=48256, Avg=80263.94, 90=97151, 99=99839, 99.9=103999, 99.99=103999] [INSERT: Count=9, Max=207, Min=122, Avg=145.67, 90=149, 99=207, 99.9=207, 99.99=207] 
2021-09-16 01:36:20:197 510 sec: 6856 operations; 13.2 current ops/sec; est completion in 3 minutes [READ: Count=125, Max=102911, Min=48352, Avg=80014.72, 90=96959, 99=101631, 99.9=102911, 99.99=102911] [INSERT: Count=7, Max=179, Min=126, Avg=150.29, 90=177, 99=179, 99.9=179, 99.99=179] 
2021-09-16 01:36:30:197 520 sec: 6988 operations; 13.2 current ops/sec; est completion in 3 minutes [READ: Count=125, Max=115839, Min=49120, Avg=80129.66, 90=97407, 99=101951, 99.9=115839, 99.99=115839] [INSERT: Count=7, Max=161, Min=59, Avg=129.71, 90=144, 99=161, 99.9=161, 99.99=161] 
2021-09-16 01:36:40:197 530 sec: 7122 operations; 13.4 current ops/sec; est completion in 3 minutes [READ: Count=125, Max=109183, Min=49056, Avg=79586.43, 90=96831, 99=100415, 99.9=109183, 99.99=109183] [INSERT: Count=9, Max=143, Min=75, Avg=121.33, 90=143, 99=143, 99.9=143, 99.99=143] 
2021-09-16 01:36:50:197 540 sec: 7248 operations; 12.6 current ops/sec; est completion in 3 minutes [READ: Count=124, Max=113535, Min=47936, Avg=80710.45, 90=96895, 99=105791, 99.9=113535, 99.99=113535] [INSERT: Count=2, Max=143, Min=138, Avg=140.5, 90=143, 99=143, 99.9=143, 99.99=143] 
2021-09-16 01:37:00:197 550 sec: 7384 operations; 13.6 current ops/sec; est completion in 3 minutes [READ: Count=128, Max=100415, Min=48384, Avg=78526.25, 90=96255, 99=99775, 99.9=100415, 99.99=100415] [INSERT: Count=9, Max=177, Min=80, Avg=136.11, 90=143, 99=177, 99.9=177, 99.99=177] 
2021-09-16 01:37:10:197 560 sec: 7521 operations; 13.7 current ops/sec; est completion in 3 minutes [READ: Count=128, Max=99327, Min=48640, Avg=77996.75, 90=96511, 99=98431, 99.9=99327, 99.99=99327] [INSERT: Count=8, Max=142, Min=89, Avg=133.12, 90=142, 99=142, 99.9=142, 99.99=142] 
2021-09-16 01:37:20:197 570 sec: 7659 operations; 13.8 current ops/sec; est completion in 2 minutes [READ: Count=128, Max=99839, Min=48128, Avg=77752.12, 90=96191, 99=98751, 99.9=99839, 99.99=99839] [INSERT: Count=10, Max=187, Min=109, Avg=140.1, 90=143, 99=187, 99.9=187, 99.99=187] 
2021-09-16 01:37:30:197 580 sec: 7792 operations; 13.3 current ops/sec; est completion in 2 minutes [READ: Count=128, Max=100159, Min=47552, Avg=77945.88, 90=96959, 99=99711, 99.9=100159, 99.99=100159] [INSERT: Count=5, Max=144, Min=100, Avg=115.4, 90=144, 99=144, 99.9=144, 99.99=144] 
2021-09-16 01:37:40:197 590 sec: 7927 operations; 13.5 current ops/sec; est completion in 2 minutes [READ: Count=127, Max=100031, Min=48288, Avg=78690.65, 90=96703, 99=99455, 99.9=100031, 99.99=100031] [INSERT: Count=8, Max=139, Min=48, Avg=101.62, 90=120, 99=139, 99.9=139, 99.99=139] 
2021-09-16 01:37:50:197 600 sec: 8058 operations; 13.1 current ops/sec; est completion in 2 minutes [READ: Count=126, Max=104319, Min=48000, Avg=79877.46, 90=97599, 99=102847, 99.9=104319, 99.99=104319] [INSERT: Count=5, Max=119, Min=61, Avg=103.4, 90=119, 99=119, 99.9=119, 99.99=119] 
2021-09-16 01:38:00:197 610 sec: 8191 operations; 13.3 current ops/sec; est completion in 2 minutes [READ: Count=125, Max=102207, Min=48128, Avg=79844.86, 90=97215, 99=100607, 99.9=102207, 99.99=102207] [INSERT: Count=8, Max=193, Min=61, Avg=118.75, 90=118, 99=193, 99.9=193, 99.99=193] 
2021-09-16 01:38:10:197 620 sec: 8326 operations; 13.5 current ops/sec; est completion in 2 minutes [READ: Count=127, Max=101631, Min=48000, Avg=78460.47, 90=96831, 99=100607, 99.9=101631, 99.99=101631] [INSERT: Count=8, Max=119, Min=97, Avg=112.62, 90=118, 99=119, 99.9=119, 99.99=119] 
2021-09-16 01:38:20:197 630 sec: 8464 operations; 13.8 current ops/sec; est completion in 1 minute [READ: Count=128, Max=99199, Min=48224, Avg=78449, 90=96447, 99=99199, 99.9=99199, 99.99=99199] [INSERT: Count=10, Max=120, Min=68, Avg=107.6, 90=120, 99=120, 99.9=120, 99.99=120] 
2021-09-16 01:38:30:197 640 sec: 8599 operations; 13.5 current ops/sec; est completion in 1 minute [READ: Count=131, Max=99839, Min=48160, Avg=76153.28, 90=94207, 99=99455, 99.9=99839, 99.99=99839] [INSERT: Count=4, Max=201, Min=117, Avg=139.75, 90=201, 99=201, 99.9=201, 99.99=201] 
2021-09-16 01:38:40:197 650 sec: 8738 operations; 13.9 current ops/sec; est completion in 1 minute [READ: Count=132, Max=102079, Min=48640, Avg=75937.7, 90=94271, 99=98879, 99.9=102079, 99.99=102079] [INSERT: Count=7, Max=212, Min=115, Avg=134.86, 90=134, 99=212, 99.9=212, 99.99=212] 
2021-09-16 01:38:50:197 660 sec: 8872 operations; 13.4 current ops/sec; est completion in 1 minute [READ: Count=123, Max=111551, Min=49184, Avg=81045.07, 90=97343, 99=106239, 99.9=111551, 99.99=111551] [INSERT: Count=11, Max=120, Min=50, Avg=102.82, 90=116, 99=120, 99.9=120, 99.99=120] 
2021-09-16 01:39:00:197 670 sec: 9005 operations; 13.3 current ops/sec; est completion in 1 minute [READ: Count=126, Max=98815, Min=48608, Avg=78990.35, 90=96447, 99=98687, 99.9=98815, 99.99=98815] [INSERT: Count=7, Max=116, Min=99, Avg=111.71, 90=115, 99=116, 99.9=116, 99.99=116] 
2021-09-16 01:39:10:197 680 sec: 9142 operations; 13.7 current ops/sec; est completion in 1 minute [READ: Count=133, Max=102847, Min=49440, Avg=75586.17, 90=96959, 99=99647, 99.9=102847, 99.99=102847] [INSERT: Count=4, Max=176, Min=114, Avg=139, 90=176, 99=176, 99.9=176, 99.99=176] 
2021-09-16 01:39:20:197 690 sec: 9278 operations; 13.6 current ops/sec; est completion in 54 seconds [READ: Count=128, Max=98751, Min=48800, Avg=77967.88, 90=95167, 99=98303, 99.9=98751, 99.99=98751] [INSERT: Count=8, Max=160, Min=23, Avg=103.5, 90=139, 99=160, 99.9=160, 99.99=160] 
2021-09-16 01:39:30:197 700 sec: 9413 operations; 13.5 current ops/sec; est completion in 44 seconds [READ: Count=130, Max=99903, Min=47936, Avg=77158.89, 90=95615, 99=99135, 99.9=99903, 99.99=99903] [INSERT: Count=5, Max=135, Min=101, Avg=115.6, 90=135, 99=135, 99.9=135, 99.99=135] 
2021-09-16 01:39:40:197 710 sec: 9550 operations; 13.7 current ops/sec; est completion in 34 seconds [READ: Count=130, Max=100415, Min=47392, Avg=76761.23, 90=95231, 99=99583, 99.9=100415, 99.99=100415] [INSERT: Count=7, Max=135, Min=70, Avg=109.43, 90=116, 99=135, 99.9=135, 99.99=135] 
2021-09-16 01:39:50:197 720 sec: 9685 operations; 13.5 current ops/sec; est completion in 24 seconds [READ: Count=127, Max=101887, Min=48160, Avg=78475.34, 90=96191, 99=99007, 99.9=101887, 99.99=101887] [INSERT: Count=8, Max=117, Min=70, Avg=106.88, 90=116, 99=117, 99.9=117, 99.99=117] 
2021-09-16 01:40:00:197 730 sec: 9822 operations; 13.7 current ops/sec; est completion in 14 seconds [READ: Count=129, Max=100927, Min=48064, Avg=77858.73, 90=97023, 99=100927, 99.9=100927, 99.99=100927] [INSERT: Count=8, Max=118, Min=48, Avg=100.5, 90=115, 99=118, 99.9=118, 99.99=118] 
2021-09-16 01:40:10:197 740 sec: 9958 operations; 13.6 current ops/sec; est completion in 4 second [READ: Count=131, Max=98751, Min=47872, Avg=75940.15, 90=95807, 99=98239, 99.9=98751, 99.99=98751] [INSERT: Count=5, Max=230, Min=70, Avg=138, 90=230, 99=230, 99.9=230, 99.99=230] 
2021-09-16 01:40:17:078 746 sec: 10000 operations; 6.1 current ops/sec; [READ: Count=40, Max=99647, Min=49920, Avg=78060, 90=93887, 99=99647, 99.9=99647, 99.99=99647] [CLEANUP: Count=1, Max=3809279, Min=3807232, Avg=3808256, 90=3809279, 99=3809279, 99.9=3809279, 99.99=3809279] [INSERT: Count=2, Max=114, Min=108, Avg=111, 90=114, 99=114, 99.9=114, 99.99=114] 
[OVERALL], RunTime(ms), 746882
[OVERALL], Throughput(ops/sec), 13.388995852089085
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 41
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.005489488299356525
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 41
[TOTAL_GC_TIME_%], Time(%), 0.005489488299356525
[READ], Operations, 9496
[READ], AverageLatency(us), 78129.37152485257
[READ], MinLatency(us), 47264
[READ], MaxLatency(us), 289279
[READ], 95thPercentileLatency(us), 97791
[READ], 99thPercentileLatency(us), 101247
[READ], Return=OK, 9496
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3808256.0
[CLEANUP], MinLatency(us), 3807232
[CLEANUP], MaxLatency(us), 3809279
[CLEANUP], 95thPercentileLatency(us), 3809279
[CLEANUP], 99thPercentileLatency(us), 3809279
[INSERT], Operations, 504
[INSERT], AverageLatency(us), 232.84126984126985
[INSERT], MinLatency(us), 23
[INSERT], MaxLatency(us), 7351
[INSERT], 95thPercentileLatency(us), 612
[INSERT], 99thPercentileLatency(us), 1062
[INSERT], Return=BATCHED_OK, 504